[Survived] StringLiteral
src/controllers/auth.controller.js:16:46
     })
 
     if (existingUser) {
-      return res.status(400).json({ message: "User already exists" })
+      return res.status(400).json({ message: "" })
     }
 

[Survived] ObjectLiteral
src/controllers/auth.controller.js:31:26
       }
     })
 
-    res.status(201).json({
-      message: "User registered",
-      user
-    })
+    res.status(201).json({})
   } catch (error) {
     console.error(error)

[Survived] BlockStatement
src/controllers/auth.controller.js:35:19
       message: "User registered",
       user
     })
-  } catch (error) {
-    console.error(error)
-    res.status(500).json({ message: "Registration failed" })
-  }
+  } catch (error) {}
 }
 

[Survived] ObjectLiteral
src/controllers/auth.controller.js:37:26
     })
   } catch (error) {
     console.error(error)
-    res.status(500).json({ message: "Registration failed" })
+    res.status(500).json({})
   }
 }

[Survived] ObjectLiteral
src/controllers/auth.controller.js:51:35
     })
 
     if (!user) {
-      return res.status(404).json({ message: "User not found" })
+      return res.status(404).json({})
     }
 

[Killed] ConditionalExpression
src/controllers/auth.controller.js:56:9
 
     const isMatch = await bcrypt.compare(password, user.password)
 
-    if (!isMatch) {
+    if (true) {
       return res.status(400).json({ message: "Invalid credentials" })
     }
killedBy: Authentication Login user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
src/controllers/auth.controller.js:56:9
 
     const isMatch = await bcrypt.compare(password, user.password)
 
-    if (!isMatch) {
+    if (false) {
       return res.status(400).json({ message: "Invalid credentials" })
     }
killedBy: Authentication Reject invalid password
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Survived] ObjectLiteral
src/controllers/auth.controller.js:57:35
     const isMatch = await bcrypt.compare(password, user.password)
 
     if (!isMatch) {
-      return res.status(400).json({ message: "Invalid credentials" })
+      return res.status(400).json({})
     }
 

[Survived] StringLiteral
src/controllers/auth.controller.js:57:46
     const isMatch = await bcrypt.compare(password, user.password)
 
     if (!isMatch) {
-      return res.status(400).json({ message: "Invalid credentials" })
+      return res.status(400).json({ message: "" })
     }
 

[Survived] ObjectLiteral
src/controllers/auth.controller.js:64:7
     const token = jwt.sign(
       { id: user.id, role: user.role },
       "SECRET_KEY",
-      { expiresIn: "1d" }
+      {}
     )
 

[Killed] ObjectLiteral
src/controllers/auth.controller.js:67:14
       { expiresIn: "1d" }
     )
 
-    res.json({
-      message: "Login successful",
-      token,
-      user
-    })
+    res.json({})
   } catch (error) {
     console.error(error)
killedBy: Authentication Login user
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "token"
Received path: []

Received value: {}

[Survived] BlockStatement
src/controllers/auth.controller.js:72:19
       token,
       user
     })
-  } catch (error) {
-    console.error(error)
-    res.status(500).json({ message: "Login failed" })
-  }
+  } catch (error) {}
 }
 

[Survived] BlockStatement
src/controllers/auth.controller.js:79:42
 }
 
 
-export const getMe = async (req, res) => {
-  try {
-    const { id } = req.user
-
-    const user = await prisma.user.findUnique({
-      where: { id }
-    })
-
-    res.json(user)
-  } catch (err) {
-    res.status(500).json({ message: "Failed to fetch user" })
-  }
-}
+export const getMe = async (req, res) => {}

[Survived] BlockStatement
src/controllers/auth.controller.js:80:7
 
 
 export const getMe = async (req, res) => {
-  try {
-    const { id } = req.user
-
-    const user = await prisma.user.findUnique({
-      where: { id }
-    })
-
-    res.json(user)
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ message: "Failed to fetch user" })
   }

[Survived] ObjectLiteral
src/controllers/auth.controller.js:83:47
   try {
     const { id } = req.user
 
-    const user = await prisma.user.findUnique({
-      where: { id }
-    })
+    const user = await prisma.user.findUnique({})
 
     res.json(user)

[Survived] ObjectLiteral
src/controllers/auth.controller.js:84:14
     const { id } = req.user
 
     const user = await prisma.user.findUnique({
-      where: { id }
+      where: {}
     })
 

[Survived] BlockStatement
src/controllers/auth.controller.js:88:17
     })
 
     res.json(user)
-  } catch (err) {
-    res.status(500).json({ message: "Failed to fetch user" })
-  }
+  } catch (err) {}
 }

[Survived] ObjectLiteral
src/controllers/auth.controller.js:89:26
 
     res.json(user)
   } catch (err) {
-    res.status(500).json({ message: "Failed to fetch user" })
+    res.status(500).json({})
   }
 }
