[Killed] ObjectLiteral
src/controllers/auction.controller.js:20:49
       deliveryDate
     } = req.body
 
-    const auction = await prisma.auction.create({
-      data: {
-        name,
-        description,
-        status: "ONGOING",
-        startDate: startDate ? new Date(startDate) : new Date(),
-        endDate: new Date(endDate),
-        deliveryDate: new Date(deliveryDate),
-
-        managerId,
-        requestId,
-
-        items: {
-          create: items.map(i => ({
-            name: i.name,
-            quantity: i.quantity
-          }))
-        }
-      }
-    })
+    const auction = await prisma.auction.create({})
 
     res.json(auction)
killedBy: Auction Workflow Create auction
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ObjectLiteral
src/controllers/auction.controller.js:21:13
     } = req.body
 
     const auction = await prisma.auction.create({
-      data: {
-        name,
-        description,
-        status: "ONGOING",
-        startDate: startDate ? new Date(startDate) : new Date(),
-        endDate: new Date(endDate),
-        deliveryDate: new Date(deliveryDate),
-
-        managerId,
-        requestId,
-
-        items: {
-          create: items.map(i => ({
-            name: i.name,
-            quantity: i.quantity
-          }))
-        }
-      }
+      data: {}
     })
 
killedBy: Auction Workflow Create auction
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Survived] StringLiteral
src/controllers/auction.controller.js:24:17
       data: {
         name,
         description,
-        status: "ONGOING",
+        status: "",
         startDate: startDate ? new Date(startDate) : new Date(),
         endDate: new Date(endDate),

[Killed] ArrowFunction
src/controllers/auction.controller.js:33:29
         requestId,
 
         items: {
-          create: items.map(i => ({
-            name: i.name,
-            quantity: i.quantity
-          }))
+          create: items.map(() => undefined)
         }
       }
killedBy: Auction Workflow Create auction
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ObjectLiteral
src/controllers/auction.controller.js:33:35
         requestId,
 
         items: {
-          create: items.map(i => ({
-            name: i.name,
-            quantity: i.quantity
-          }))
+          create: items.map(i => ({}))
         }
       }
killedBy: Auction Workflow Create auction
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Survived] BlockStatement
src/controllers/auction.controller.js:43:17
 
     res.json(auction)
 
-  } catch (err) {
-    console.error(err)
-    res.status(500).json({ error: "Failed to create auction" })
-  }
+  } catch (err) {}
 }
 

[Survived] BlockStatement
src/controllers/auction.controller.js:50:48
 }
 
 /* GET AUCTIONS */
-export const getAuctions = async (req, res) => {
-  try {
-    const auctions = await prisma.auction.findMany({
-      include: {
-        items: true,
-        invites: true
-      }
-    })
-
-    res.json(auctions)
-  } catch (err) {
-    res.status(500).json({ error: "Failed" })
-  }
-}
+export const getAuctions = async (req, res) => {}
 
 /* INVITE VENDOR */

[Survived] BlockStatement
src/controllers/auction.controller.js:51:7
 
 /* GET AUCTIONS */
 export const getAuctions = async (req, res) => {
-  try {
-    const auctions = await prisma.auction.findMany({
-      include: {
-        items: true,
-        invites: true
-      }
-    })
-
-    res.json(auctions)
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: "Failed" })
   }

[Survived] ObjectLiteral
src/controllers/auction.controller.js:52:52
 /* GET AUCTIONS */
 export const getAuctions = async (req, res) => {
   try {
-    const auctions = await prisma.auction.findMany({
-      include: {
-        items: true,
-        invites: true
-      }
-    })
+    const auctions = await prisma.auction.findMany({})
 
     res.json(auctions)

[Survived] BooleanLiteral
src/controllers/auction.controller.js:55:18
     const auctions = await prisma.auction.findMany({
       include: {
         items: true,
-        invites: true
+        invites: false
       }
     })

[Survived] BlockStatement
src/controllers/auction.controller.js:60:17
     })
 
     res.json(auctions)
-  } catch (err) {
-    res.status(500).json({ error: "Failed" })
-  }
+  } catch (err) {}
 }
 

[Survived] StringLiteral
src/controllers/auction.controller.js:61:35
 
     res.json(auctions)
   } catch (err) {
-    res.status(500).json({ error: "Failed" })
+    res.status(500).json({ error: "" })
   }
 }

[Survived] BlockStatement
src/controllers/auction.controller.js:66:49
 }
 
 /* INVITE VENDOR */
-export const inviteVendor = async (req, res) => {
-  try {
-    const { auctionId } = req.params
-    const { vendorId } = req.body
-
-    await prisma.auctionInvite.create({
-      data: {
-        auctionId,
-        vendorId
-      }
-    })
-
-    res.json({ message: "Vendor invited" })
-
-  } catch (err) {
-    console.error(err)
-    res.status(500).json({ error: "Failed to invite" })
-  }
-}
+export const inviteVendor = async (req, res) => {}
 
 /* GET VENDORS */

[Survived] BlockStatement
src/controllers/auction.controller.js:67:7
 
 /* INVITE VENDOR */
 export const inviteVendor = async (req, res) => {
-  try {
-    const { auctionId } = req.params
-    const { vendorId } = req.body
-
-    await prisma.auctionInvite.create({
-      data: {
-        auctionId,
-        vendorId
-      }
-    })
-
-    res.json({ message: "Vendor invited" })
-
-  } catch (err) {
+  try {} catch (err) {
     console.error(err)
     res.status(500).json({ error: "Failed to invite" })

[Survived] ObjectLiteral
src/controllers/auction.controller.js:71:39
     const { auctionId } = req.params
     const { vendorId } = req.body
 
-    await prisma.auctionInvite.create({
-      data: {
-        auctionId,
-        vendorId
-      }
-    })
+    await prisma.auctionInvite.create({})
 
     res.json({ message: "Vendor invited" })

[Survived] ObjectLiteral
src/controllers/auction.controller.js:72:13
     const { vendorId } = req.body
 
     await prisma.auctionInvite.create({
-      data: {
-        auctionId,
-        vendorId
-      }
+      data: {}
     })
 

[Survived] BlockStatement
src/controllers/auction.controller.js:80:17
 
     res.json({ message: "Vendor invited" })
 
-  } catch (err) {
-    console.error(err)
-    res.status(500).json({ error: "Failed to invite" })
-  }
+  } catch (err) {}
 }
 

[Survived] BlockStatement
src/controllers/auction.controller.js:87:47
 }
 
 /* GET VENDORS */
-export const getVendors = async (req, res) => {
-  try {
-    const vendors = await prisma.user.findMany({
-      where: { role: "VENDOR" }
-    })
-
-    res.json(vendors)
-
-  } catch (err) {
-    res.status(500).json({ error: "Failed" })
-  }
-}
+export const getVendors = async (req, res) => {}
 
 

[Survived] BlockStatement
src/controllers/auction.controller.js:88:7
 
 /* GET VENDORS */
 export const getVendors = async (req, res) => {
-  try {
-    const vendors = await prisma.user.findMany({
-      where: { role: "VENDOR" }
-    })
-
-    res.json(vendors)
-
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: "Failed" })
   }

[Survived] BlockStatement
src/controllers/auction.controller.js:95:17
 
     res.json(vendors)
 
-  } catch (err) {
-    res.status(500).json({ error: "Failed" })
-  }
+  } catch (err) {}
 }
 

[Survived] BlockStatement
src/controllers/auction.controller.js:103:49
 
 
 
-export const addToAuction = async (req, res) => {
-  try {
-    const { auctionId } = req.params
-    const { requestId } = req.body
-
-    const request = await prisma.request.findUnique({
-      where: { id: requestId },
-      include: { items: true }
-    })
-
-    await prisma.auctionItem.createMany({
-      data: request.items.map(i => ({
-        name: i.name,
-        quantity: i.quantity,
-        auctionId
-      }))
-    })
-
-    res.json({ message: "Added to auction" })
-
-  } catch (err) {
-    console.error(err)
-    res.status(500).json({ error: "Failed" })
-  }
-}
+export const addToAuction = async (req, res) => {}
 
 

[Survived] BlockStatement
src/controllers/auction.controller.js:104:7
 
 
 export const addToAuction = async (req, res) => {
-  try {
-    const { auctionId } = req.params
-    const { requestId } = req.body
-
-    const request = await prisma.request.findUnique({
-      where: { id: requestId },
-      include: { items: true }
-    })
-
-    await prisma.auctionItem.createMany({
-      data: request.items.map(i => ({
-        name: i.name,
-        quantity: i.quantity,
-        auctionId
-      }))
-    })
-
-    res.json({ message: "Added to auction" })
-
-  } catch (err) {
+  try {} catch (err) {
     console.error(err)
     res.status(500).json({ error: "Failed" })

[Survived] BooleanLiteral
src/controllers/auction.controller.js:110:25
 
     const request = await prisma.request.findUnique({
       where: { id: requestId },
-      include: { items: true }
+      include: { items: false }
     })
 

[Survived] ArrowFunction
src/controllers/auction.controller.js:114:31
     })
 
     await prisma.auctionItem.createMany({
-      data: request.items.map(i => ({
-        name: i.name,
-        quantity: i.quantity,
-        auctionId
-      }))
+      data: request.items.map(() => undefined)
     })
 

[Survived] BlockStatement
src/controllers/auction.controller.js:123:17
 
     res.json({ message: "Added to auction" })
 
-  } catch (err) {
-    console.error(err)
-    res.status(500).json({ error: "Failed" })
-  }
+  } catch (err) {}
 }
 

[Survived] BlockStatement
src/controllers/auction.controller.js:133:7
 
 
 export const updateAuction = async (req, res) => {
-  try {
-    const { auctionId } = req.params
-    const {
-      name,
-      description,
-      startDate,
-      endDate,
-      deliveryDate
-    } = req.body
-
-    const updated = await prisma.auction.update({
-      where: { id: auctionId },
-      data: {
-        name,
-        description,
-        startDate: new Date(startDate),
-        endDate: new Date(endDate),
-        deliveryDate: new Date(deliveryDate)
-      }
-    })
-
-    res.json(updated)
-
-  } catch (err) {
+  try {} catch (err) {
     console.error(err)
     res.status(500).json({ error: "Update failed" })

[Survived] BlockStatement
src/controllers/auction.controller.js:156:17
 
     res.json(updated)
 
-  } catch (err) {
-    console.error(err)
-    res.status(500).json({ error: "Update failed" })
-  }
+  } catch (err) {}
 }
 

[Killed] ObjectLiteral
src/controllers/auction.controller.js:167:10
     const { auctionId } = req.params
     const { vendorId, amount, deliveryDate, notes } = req.body
 const existing = await prisma.bid.findFirst({
-  where: {
-    auctionId,
-    vendorId
-  }
+  where: {}
 })
 
killedBy: Auction Workflow Submit bid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BlockStatement
src/controllers/auction.controller.js:173:15
   }
 })
 
-if (existing) {
-  return res.status(400).json({
-    error: "You already submitted a bid"
-  })
-}
+if (existing) {}
     const bid = await prisma.bid.create({
       data: {
killedBy: Auction Workflow Prevent duplicate bid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Survived] BlockStatement
src/controllers/auction.controller.js:190:17
 
     res.json(bid)
 
-  } catch (err) {
-    console.error(err)
-    res.status(500).json({ error: "Failed to submit bid" })
-  }
+  } catch (err) {}
 }
 

[Survived] StringLiteral
src/controllers/auction.controller.js:192:35
 
   } catch (err) {
     console.error(err)
-    res.status(500).json({ error: "Failed to submit bid" })
+    res.status(500).json({ error: "" })
   }
 }

[Survived] ObjectLiteral
src/controllers/auction.controller.js:192:26
 
   } catch (err) {
     console.error(err)
-    res.status(500).json({ error: "Failed to submit bid" })
+    res.status(500).json({})
   }
 }

[Survived] BlockStatement
src/controllers/auction.controller.js:197:51
 }
 
 
-export const getAuctionBids = async (req, res) => {
-  try {
-    const { auctionId } = req.params
-
-    const bids = await prisma.bid.findMany({
-      where: {
-        auctionId
-      },
-      include: {
-        vendor: true
-      },
-      orderBy: {
-        amount: "asc"
-      }
-    })
-
-    res.json(bids)
-
-  } catch (err) {
-    console.error("GET BIDS ERROR:", err)
-    res.status(500).json({
-      error: "Failed to fetch bids"
-    })
-  }
-}
+export const getAuctionBids = async (req, res) => {}
 
 

[Survived] BlockStatement
src/controllers/auction.controller.js:198:7
 
 
 export const getAuctionBids = async (req, res) => {
-  try {
-    const { auctionId } = req.params
-
-    const bids = await prisma.bid.findMany({
-      where: {
-        auctionId
-      },
-      include: {
-        vendor: true
-      },
-      orderBy: {
-        amount: "asc"
-      }
-    })
-
-    res.json(bids)
-
-  } catch (err) {
+  try {} catch (err) {
     console.error("GET BIDS ERROR:", err)
     res.status(500).json({

[Survived] ObjectLiteral
src/controllers/auction.controller.js:201:44
   try {
     const { auctionId } = req.params
 
-    const bids = await prisma.bid.findMany({
-      where: {
-        auctionId
-      },
-      include: {
-        vendor: true
-      },
-      orderBy: {
-        amount: "asc"
-      }
-    })
+    const bids = await prisma.bid.findMany({})
 
     res.json(bids)

[Survived] ObjectLiteral
src/controllers/auction.controller.js:205:16
       where: {
         auctionId
       },
-      include: {
-        vendor: true
-      },
+      include: {},
       orderBy: {
         amount: "asc"

[Survived] BooleanLiteral
src/controllers/auction.controller.js:206:17
         auctionId
       },
       include: {
-        vendor: true
+        vendor: false
       },
       orderBy: {

[Survived] ObjectLiteral
src/controllers/auction.controller.js:208:16
       include: {
         vendor: true
       },
-      orderBy: {
-        amount: "asc"
-      }
+      orderBy: {}
     })
 

[Survived] BlockStatement
src/controllers/auction.controller.js:215:17
 
     res.json(bids)
 
-  } catch (err) {
-    console.error("GET BIDS ERROR:", err)
-    res.status(500).json({
-      error: "Failed to fetch bids"
-    })
-  }
+  } catch (err) {}
 }
 

[Survived] ObjectLiteral
src/controllers/auction.controller.js:217:26
 
   } catch (err) {
     console.error("GET BIDS ERROR:", err)
-    res.status(500).json({
-      error: "Failed to fetch bids"
-    })
+    res.status(500).json({})
   }
 }

[Survived] ObjectLiteral
src/controllers/auction.controller.js:228:45
   try {
     const { auctionId, bidId } = req.params
 
-    const bid = await prisma.bid.findUnique({
-      where: { id: bidId },
-      include: {
-        auction: {
-          include: { items: true }
-        }
-      }
-    })
+    const bid = await prisma.bid.findUnique({})
 
     if (!bid) {

[Survived] BooleanLiteral
src/controllers/auction.controller.js:232:29
       where: { id: bidId },
       include: {
         auction: {
-          include: { items: true }
+          include: { items: false }
         }
       }

[Survived] ConditionalExpression
src/controllers/auction.controller.js:237:9
       }
     })
 
-    if (!bid) {
+    if (true) {
       return res.status(404).json({ error: "Bid not found" })
     }

[Timeout] BooleanLiteral
src/controllers/auction.controller.js:237:9
       }
     })
 
-    if (!bid) {
+    if (bid) {
       return res.status(404).json({ error: "Bid not found" })
     }

[Survived] StringLiteral
src/controllers/auction.controller.js:238:44
     })
 
     if (!bid) {
-      return res.status(404).json({ error: "Bid not found" })
+      return res.status(404).json({ error: "" })
     }
 

[Survived] ObjectLiteral
src/controllers/auction.controller.js:242:45
     }
 
     /* CREATE ORDER */
-    const order = await prisma.order.create({
-      data: {
-        name: `Auction Order - ${Date.now()}`,
-        status: "ACCEPTED",
-        managerId: bid.auction.managerId,
-        vendorId: bid.vendorId,
-
-        items: {
-          create: bid.auction.items.map(i => ({
-            name: i.name,
-            quantity: i.quantity,
-            unitPrice: bid.amount / bid.auction.items.length
-          }))
-        }
-      }
-    })
+    const order = await prisma.order.create({})
 
     /* UPDATE BIDS */

[Survived] ObjectLiteral
src/controllers/auction.controller.js:243:13
 
     /* CREATE ORDER */
     const order = await prisma.order.create({
-      data: {
-        name: `Auction Order - ${Date.now()}`,
-        status: "ACCEPTED",
-        managerId: bid.auction.managerId,
-        vendorId: bid.vendorId,
-
-        items: {
-          create: bid.auction.items.map(i => ({
-            name: i.name,
-            quantity: i.quantity,
-            unitPrice: bid.amount / bid.auction.items.length
-          }))
-        }
-      }
+      data: {}
     })
 

[Survived] StringLiteral
src/controllers/auction.controller.js:244:15
     /* CREATE ORDER */
     const order = await prisma.order.create({
       data: {
-        name: `Auction Order - ${Date.now()}`,
+        name: ``,
         status: "ACCEPTED",
         managerId: bid.auction.managerId,

[Survived] ArrowFunction
src/controllers/auction.controller.js:250:41
         vendorId: bid.vendorId,
 
         items: {
-          create: bid.auction.items.map(i => ({
-            name: i.name,
-            quantity: i.quantity,
-            unitPrice: bid.amount / bid.auction.items.length
-          }))
+          create: bid.auction.items.map(() => undefined)
         }
       }

[Survived] ArithmeticOperator
src/controllers/auction.controller.js:253:24
           create: bid.auction.items.map(i => ({
             name: i.name,
             quantity: i.quantity,
-            unitPrice: bid.amount / bid.auction.items.length
+            unitPrice: bid.amount * bid.auction.items.length
           }))
         }

[Survived] StringLiteral
src/controllers/auction.controller.js:267:23
 
     await prisma.bid.update({
       where: { id: bidId },
-      data: { status: "SELECTED" }
+      data: { status: "" }
     })
 

[Survived] BlockStatement
src/controllers/auction.controller.js:280:17
 
     res.json(order)
 
-  } catch (err) {
-    console.error(err)
-    res.status(500).json({ error: "Failed to select bid" })
-  }
+  } catch (err) {}
 }

[Survived] StringLiteral
src/controllers/auction.controller.js:282:35
 
   } catch (err) {
     console.error(err)
-    res.status(500).json({ error: "Failed to select bid" })
+    res.status(500).json({ error: "" })
   }
 }
