[Killed] ArrowFunction
src/controllers/employee.controller.js:31:7
 
     // calculate total
     const totalAmount = items.reduce(
-      (sum, item) => sum + item.quantity * item.unitPrice,
+      () => undefined,
       0
     )
killedBy: Procurement Workflow Integration should create procurement request
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Survived] ArithmeticOperator
src/controllers/employee.controller.js:31:28
 
     // calculate total
     const totalAmount = items.reduce(
-      (sum, item) => sum + item.quantity * item.unitPrice,
+      (sum, item) => sum + item.quantity / item.unitPrice,
       0
     )

[Killed] ObjectLiteral
src/controllers/employee.controller.js:35:49
       0
     )
 
-    const request = await prisma.request.create({
-      data: {
-        title,
-        description,
-        totalAmount,
-        employeeId,
-        items: {
-          create: items
-        }
-      },
-      include: {
-        items: true
-      }
-    })
+    const request = await prisma.request.create({})
 
     res.status(201).json(request)
killedBy: Employee Request API should create procurement request
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Survived] ObjectLiteral
src/controllers/employee.controller.js:45:16
           create: items
         }
       },
-      include: {
-        items: true
-      }
+      include: {}
     })
 

[Survived] BooleanLiteral
src/controllers/employee.controller.js:46:16
         }
       },
       include: {
-        items: true
+        items: false
       }
     })

[Survived] BlockStatement
src/controllers/employee.controller.js:51:17
     })
 
     res.status(201).json(request)
-  } catch (err) {
-    console.error(err)
-    res.status(500).json({ error: "Failed to create request" })
-  }
+  } catch (err) {}
 }
 

[Survived] BlockStatement
src/controllers/employee.controller.js:74:50
 //   }
 // }
 
-export const getMyRequests = async (req, res) => {
-  try {
-    const { employeeId } = req.params
-
-    const requests = await prisma.request.findMany({
-      where: { employeeId },
-      include: { items: true },
-      orderBy: { createdAt: "desc" }
-    })
-
-    res.json(requests)
-  } catch (err) {
-    console.error(err)
-    res.status(500).json({ error: "Failed to fetch requests" })
-  }
-}
+export const getMyRequests = async (req, res) => {}

[Survived] BlockStatement
src/controllers/employee.controller.js:75:7
 // }
 
 export const getMyRequests = async (req, res) => {
-  try {
-    const { employeeId } = req.params
-
-    const requests = await prisma.request.findMany({
-      where: { employeeId },
-      include: { items: true },
-      orderBy: { createdAt: "desc" }
-    })
-
-    res.json(requests)
-  } catch (err) {
+  try {} catch (err) {
     console.error(err)
     res.status(500).json({ error: "Failed to fetch requests" })

[Survived] ObjectLiteral
src/controllers/employee.controller.js:78:52
   try {
     const { employeeId } = req.params
 
-    const requests = await prisma.request.findMany({
-      where: { employeeId },
-      include: { items: true },
-      orderBy: { createdAt: "desc" }
-    })
+    const requests = await prisma.request.findMany({})
 
     res.json(requests)

[Survived] BooleanLiteral
src/controllers/employee.controller.js:80:25
 
     const requests = await prisma.request.findMany({
       where: { employeeId },
-      include: { items: true },
+      include: { items: false },
       orderBy: { createdAt: "desc" }
     })

[Survived] BlockStatement
src/controllers/employee.controller.js:85:17
     })
 
     res.json(requests)
-  } catch (err) {
-    console.error(err)
-    res.status(500).json({ error: "Failed to fetch requests" })
-  }
+  } catch (err) {}
 }
