[Survived] ObjectLiteral
src/controllers/finance.controller.js:8:54
   try {
     const financeId = req.user.id
 
-    const financeUser = await prisma.user.findUnique({
-      where: { id: financeId }
-    })
+    const financeUser = await prisma.user.findUnique({})
 
     const invoices = await prisma.invoice.findMany({

[Survived] ObjectLiteral
src/controllers/finance.controller.js:13:14
     })
 
     const invoices = await prisma.invoice.findMany({
-      where: {
-        vendorOrder: {
-          order: {
-            manager: {
-              orgName: financeUser.orgName
-            }
-          }
-        }
-      },
+      where: {},
       include: {
         vendorOrder: {

[Survived] ObjectLiteral
src/controllers/finance.controller.js:15:18
     const invoices = await prisma.invoice.findMany({
       where: {
         vendorOrder: {
-          order: {
-            manager: {
-              orgName: financeUser.orgName
-            }
-          }
+          order: {}
         }
       },

[Survived] ObjectLiteral
src/controllers/finance.controller.js:16:22
       where: {
         vendorOrder: {
           order: {
-            manager: {
-              orgName: financeUser.orgName
-            }
+            manager: {}
           }
         }

[Survived] ObjectLiteral
src/controllers/finance.controller.js:22:16
           }
         }
       },
-      include: {
-        vendorOrder: {
-          include: {
-            vendor: true,
-            order: {
-              include: {
-                items: true,
-                manager: true
-              }
-            }
-          }
-        },
-        payment: true
-      },
+      include: {},
       orderBy: {
         issuedAt: "desc"

[Survived] ObjectLiteral
src/controllers/finance.controller.js:24:20
       },
       include: {
         vendorOrder: {
-          include: {
-            vendor: true,
-            order: {
-              include: {
-                items: true,
-                manager: true
-              }
-            }
-          }
+          include: {}
         },
         payment: true

[Survived] BooleanLiteral
src/controllers/finance.controller.js:25:21
       include: {
         vendorOrder: {
           include: {
-            vendor: true,
+            vendor: false,
             order: {
               include: {

[Survived] ObjectLiteral
src/controllers/finance.controller.js:26:20
         vendorOrder: {
           include: {
             vendor: true,
-            order: {
-              include: {
-                items: true,
-                manager: true
-              }
-            }
+            order: {}
           }
         },

[Survived] BooleanLiteral
src/controllers/finance.controller.js:29:26
             order: {
               include: {
                 items: true,
-                manager: true
+                manager: false
               }
             }

[Survived] BooleanLiteral
src/controllers/finance.controller.js:34:18
             }
           }
         },
-        payment: true
+        payment: false
       },
       orderBy: {

[Survived] ObjectLiteral
src/controllers/finance.controller.js:36:16
         },
         payment: true
       },
-      orderBy: {
-        issuedAt: "desc"
-      }
+      orderBy: {}
     })
 

[Survived] BlockStatement
src/controllers/finance.controller.js:43:17
 
     res.json(invoices)
 
-  } catch (err) {
-    console.error("GET FINANCE INVOICES ERROR:", err)
-    res.status(500).json({
-      error: "Failed to fetch invoices"
-    })
-  }
+  } catch (err) {}
 }
 

[Survived] StringLiteral
src/controllers/finance.controller.js:44:19
     res.json(invoices)
 
   } catch (err) {
-    console.error("GET FINANCE INVOICES ERROR:", err)
+    console.error("", err)
     res.status(500).json({
       error: "Failed to fetch invoices"

[Survived] ObjectLiteral
src/controllers/finance.controller.js:45:26
 
   } catch (err) {
     console.error("GET FINANCE INVOICES ERROR:", err)
-    res.status(500).json({
-      error: "Failed to fetch invoices"
-    })
+    res.status(500).json({})
   }
 }

[Survived] BlockStatement
src/controllers/finance.controller.js:61:19
       where: { id: invoiceId }
     })
 
-    if (!invoice) {
-      return res.status(404).json({
-        error: "Invoice not found"
-      })
-    }
+    if (!invoice) {}
 
     await prisma.payment.create({

[Survived] ConditionalExpression
src/controllers/finance.controller.js:61:9
       where: { id: invoiceId }
     })
 
-    if (!invoice) {
+    if (false) {
       return res.status(404).json({
         error: "Invoice not found"

[Survived] ObjectLiteral
src/controllers/finance.controller.js:62:35
     })
 
     if (!invoice) {
-      return res.status(404).json({
-        error: "Invoice not found"
-      })
+      return res.status(404).json({})
     }
 

[Survived] ObjectLiteral
src/controllers/finance.controller.js:67:33
       })
     }
 
-    await prisma.payment.create({
-      data: {
-        amount: invoice.totalAmount,
-        status: "COMPLETED",
-        paidAt: new Date(),
-        invoiceId,
-        financeId
-      }
-    })
+    await prisma.payment.create({})
 
     const updated = await prisma.invoice.update({

[Survived] ObjectLiteral
src/controllers/finance.controller.js:77:49
       }
     })
 
-    const updated = await prisma.invoice.update({
-      where: { id: invoiceId },
-      data: {
-        status: "PAID"
-      }
-    })
+    const updated = await prisma.invoice.update({})
 
     res.json(updated)

[Survived] ObjectLiteral
src/controllers/finance.controller.js:79:13
 
     const updated = await prisma.invoice.update({
       where: { id: invoiceId },
-      data: {
-        status: "PAID"
-      }
+      data: {}
     })
 

[Survived] BlockStatement
src/controllers/finance.controller.js:86:17
 
     res.json(updated)
 
-  } catch (err) {
-    console.error("APPROVE INVOICE ERROR:", err)
-    res.status(500).json({
-      error: "Failed to approve invoice"
-    })
-  }
+  } catch (err) {}
 }
 

[Survived] StringLiteral
src/controllers/finance.controller.js:89:14
   } catch (err) {
     console.error("APPROVE INVOICE ERROR:", err)
     res.status(500).json({
-      error: "Failed to approve invoice"
+      error: ""
     })
   }

[Killed] BlockStatement
src/controllers/finance.controller.js:95:50
 }
 
 /* REJECT */
-export const rejectInvoice = async (req, res) => {
-  try {
-    const { invoiceId } = req.params
-
-    const invoice = await prisma.invoice.update({
-      where: { id: invoiceId },
-      data: {
-        status: "REJECTED"
-      }
-    })
-
-    res.json(invoice)
-
-  } catch (err) {
-    console.error("REJECT INVOICE ERROR:", err)
-    res.status(500).json({
-      error: "Failed to reject invoice"
-    })
-  }
-}
+export const rejectInvoice = async (req, res) => {}
killedBy: Finance Invoice Processing Reject invoice
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/controllers/finance.controller.js:96:7
 
 /* REJECT */
 export const rejectInvoice = async (req, res) => {
-  try {
-    const { invoiceId } = req.params
-
-    const invoice = await prisma.invoice.update({
-      where: { id: invoiceId },
-      data: {
-        status: "REJECTED"
-      }
-    })
-
-    res.json(invoice)
-
-  } catch (err) {
+  try {} catch (err) {
     console.error("REJECT INVOICE ERROR:", err)
     res.status(500).json({
killedBy: Finance Invoice Processing Reject invoice
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ObjectLiteral
src/controllers/finance.controller.js:100:14
     const { invoiceId } = req.params
 
     const invoice = await prisma.invoice.update({
-      where: { id: invoiceId },
+      where: {},
       data: {
         status: "REJECTED"
killedBy: Finance Invoice Processing Reject invoice
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Survived] ObjectLiteral
src/controllers/finance.controller.js:101:13
 
     const invoice = await prisma.invoice.update({
       where: { id: invoiceId },
-      data: {
-        status: "REJECTED"
-      }
+      data: {}
     })
 

[Survived] BlockStatement
src/controllers/finance.controller.js:108:17
 
     res.json(invoice)
 
-  } catch (err) {
-    console.error("REJECT INVOICE ERROR:", err)
-    res.status(500).json({
-      error: "Failed to reject invoice"
-    })
-  }
+  } catch (err) {}
 }

[Survived] ObjectLiteral
src/controllers/finance.controller.js:110:26
 
   } catch (err) {
     console.error("REJECT INVOICE ERROR:", err)
-    res.status(500).json({
-      error: "Failed to reject invoice"
-    })
+    res.status(500).json({})
   }
 }
