[Survived] BlockStatement
src/controllers/manager.controller.js:4:55
 import prisma from "../config/db.js"
 
 // GET all pending requests
-export const getPendingRequests = async (req, res) => {
-  try {
-    const requests = await prisma.request.findMany({
-
-      include: {
-        items: true,
-        employee: true
-      },
-      orderBy: { createdAt: "desc" }
-    })
-
-    res.json(requests)
-  } catch (err) {
-    console.error(err)
-    res.status(500).json({ error: "Failed to fetch requests" })
-  }
-}
+export const getPendingRequests = async (req, res) => {}
 
 // APPROVE / REJECT

[Survived] BlockStatement
src/controllers/manager.controller.js:5:7
 
 // GET all pending requests
 export const getPendingRequests = async (req, res) => {
-  try {
-    const requests = await prisma.request.findMany({
-
-      include: {
-        items: true,
-        employee: true
-      },
-      orderBy: { createdAt: "desc" }
-    })
-
-    res.json(requests)
-  } catch (err) {
+  try {} catch (err) {
     console.error(err)
     res.status(500).json({ error: "Failed to fetch requests" })

[Survived] ObjectLiteral
src/controllers/manager.controller.js:6:52
 // GET all pending requests
 export const getPendingRequests = async (req, res) => {
   try {
-    const requests = await prisma.request.findMany({
-
-      include: {
-        items: true,
-        employee: true
-      },
-      orderBy: { createdAt: "desc" }
-    })
+    const requests = await prisma.request.findMany({})
 
     res.json(requests)

[Survived] BooleanLiteral
src/controllers/manager.controller.js:10:19
 
       include: {
         items: true,
-        employee: true
+        employee: false
       },
       orderBy: { createdAt: "desc" }

[Survived] StringLiteral
src/controllers/manager.controller.js:12:29
         items: true,
         employee: true
       },
-      orderBy: { createdAt: "desc" }
+      orderBy: { createdAt: "" }
     })
 

[Survived] ObjectLiteral
src/controllers/manager.controller.js:18:26
     res.json(requests)
   } catch (err) {
     console.error(err)
-    res.status(500).json({ error: "Failed to fetch requests" })
+    res.status(500).json({})
   }
 }

[Survived] StringLiteral
src/controllers/manager.controller.js:18:35
     res.json(requests)
   } catch (err) {
     console.error(err)
-    res.status(500).json({ error: "Failed to fetch requests" })
+    res.status(500).json({ error: "" })
   }
 }

[Killed] ObjectLiteral
src/controllers/manager.controller.js:33:13
     // 1. Update request status FIRST
     const updatedRequest = await prisma.request.update({
       where: { id: requestId },
-      data: { status }
+      data: {}
     })
 
killedBy: Procurement Workflow Integration should approve previously created request
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "PENDING"

[Survived] StringLiteral
src/controllers/manager.controller.js:36:17
       data: { status }
     })
 
-    console.log("REQUEST UPDATED:", updatedRequest.id)
+    console.log("", updatedRequest.id)
 
     // 2. Always try create (safe fallback)

[Killed] BlockStatement
src/controllers/manager.controller.js:39:9
     console.log("REQUEST UPDATED:", updatedRequest.id)
 
     // 2. Always try create (safe fallback)
-    try {
-      await prisma.approval.create({
-        data: {
-          status,
-          comments,
-          requestId,
-          managerId
-        }
-      })
-    } catch (e) {
+    try {} catch (e) {
       console.log("Approval already exists, skipping create")
     }
killedBy: Procurement Workflow Integration should approve previously created request
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Survived] BlockStatement
src/controllers/manager.controller.js:48:17
           managerId
         }
       })
-    } catch (e) {
-      console.log("Approval already exists, skipping create")
-    }
+    } catch (e) {}
 
     res.json({ message: "Approval successful" })

[Survived] StringLiteral
src/controllers/manager.controller.js:52:25
       console.log("Approval already exists, skipping create")
     }
 
-    res.json({ message: "Approval successful" })
+    res.json({ message: "" })
 
   } catch (err) {

[Survived] BlockStatement
src/controllers/manager.controller.js:54:17
 
     res.json({ message: "Approval successful" })
 
-  } catch (err) {
-    console.error("APPROVAL ERROR FULL:", err)
-    res.status(500).json({ error: "Approval failed" })
-  }
+  } catch (err) {}
 }

[Survived] StringLiteral
src/controllers/manager.controller.js:55:19
     res.json({ message: "Approval successful" })
 
   } catch (err) {
-    console.error("APPROVAL ERROR FULL:", err)
+    console.error("", err)
     res.status(500).json({ error: "Approval failed" })
   }

[Survived] StringLiteral
src/controllers/manager.controller.js:56:35
 
   } catch (err) {
     console.error("APPROVAL ERROR FULL:", err)
-    res.status(500).json({ error: "Approval failed" })
+    res.status(500).json({ error: "" })
   }
 }
