[Killed] ConditionalExpression
src/controllers/order.controller.js:13:9
       include: { items: true }
     })
 
-    if (!request) {
+    if (true) {
       return res.status(404).json({ error: "Request not found" })
     }
killedBy: Order Creation Workflow should create order from approved request
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 404

[Killed] BooleanLiteral
src/controllers/order.controller.js:13:9
       include: { items: true }
     })
 
-    if (!request) {
+    if (request) {
       return res.status(404).json({ error: "Request not found" })
     }
killedBy: Order Creation Workflow should create order from approved request
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 404

[Killed] ArrowFunction
src/controllers/order.controller.js:24:33
     managerId,
     status: "DRAFT",
     items: {
-      create: request.items.map(i => ({
-        name: i.name,
-        quantity: i.quantity,
-        unitPrice: i.unitPrice
-      }))
+      create: request.items.map(() => undefined)
     }
   }
killedBy: Order Creation Workflow should create order from approved request
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Survived] BlockStatement
src/controllers/order.controller.js:41:17
 
     res.status(201).json(order)
 
-  } catch (err) {
-    console.error("ORDER CREATE ERROR:", err)
-    res.status(500).json({ error: "Failed to create order" })
-  }
+  } catch (err) {}
 }
 

[Survived] ObjectLiteral
src/controllers/order.controller.js:43:26
 
   } catch (err) {
     console.error("ORDER CREATE ERROR:", err)
-    res.status(500).json({ error: "Failed to create order" })
+    res.status(500).json({})
   }
 }

[Survived] BlockStatement
src/controllers/order.controller.js:49:46
 
 
 // GET ALL ORDERS
-export const getOrders = async (req, res) => {
-  try {
-    const orders = await prisma.order.findMany({
-      include: {
-        items: true,
-        requests: true,
-        vendor: true
-      },
-      orderBy: { createdAt: "desc" }
-    })
-    console.log(JSON.stringify(orders, null, 2))
-    console.log("ORDERS FROM DB:", orders)
-
-    res.json(orders)
-  } catch (err) {
-    console.error("GET ORDERS ERROR:", err)
-    res.status(500).json({ error: "Failed to fetch orders" })
-  }
-}
+export const getOrders = async (req, res) => {}
 
 

[Survived] BlockStatement
src/controllers/order.controller.js:50:7
 
 // GET ALL ORDERS
 export const getOrders = async (req, res) => {
-  try {
-    const orders = await prisma.order.findMany({
-      include: {
-        items: true,
-        requests: true,
-        vendor: true
-      },
-      orderBy: { createdAt: "desc" }
-    })
-    console.log(JSON.stringify(orders, null, 2))
-    console.log("ORDERS FROM DB:", orders)
-
-    res.json(orders)
-  } catch (err) {
+  try {} catch (err) {
     console.error("GET ORDERS ERROR:", err)
     res.status(500).json({ error: "Failed to fetch orders" })

[Survived] ObjectLiteral
src/controllers/order.controller.js:51:48
 // GET ALL ORDERS
 export const getOrders = async (req, res) => {
   try {
-    const orders = await prisma.order.findMany({
-      include: {
-        items: true,
-        requests: true,
-        vendor: true
-      },
-      orderBy: { createdAt: "desc" }
-    })
+    const orders = await prisma.order.findMany({})
     console.log(JSON.stringify(orders, null, 2))
     console.log("ORDERS FROM DB:", orders)

[Survived] BooleanLiteral
src/controllers/order.controller.js:54:19
     const orders = await prisma.order.findMany({
       include: {
         items: true,
-        requests: true,
+        requests: false,
         vendor: true
       },

[Survived] BooleanLiteral
src/controllers/order.controller.js:55:17
       include: {
         items: true,
         requests: true,
-        vendor: true
+        vendor: false
       },
       orderBy: { createdAt: "desc" }

[Survived] BlockStatement
src/controllers/order.controller.js:63:17
     console.log("ORDERS FROM DB:", orders)
 
     res.json(orders)
-  } catch (err) {
-    console.error("GET ORDERS ERROR:", err)
-    res.status(500).json({ error: "Failed to fetch orders" })
-  }
+  } catch (err) {}
 }
 

[Survived] ObjectLiteral
src/controllers/order.controller.js:65:26
     res.json(orders)
   } catch (err) {
     console.error("GET ORDERS ERROR:", err)
-    res.status(500).json({ error: "Failed to fetch orders" })
+    res.status(500).json({})
   }
 }

[Survived] ObjectLiteral
src/controllers/order.controller.js:80:14
     const { requestId } = req.body
 
     const request = await prisma.request.findUnique({
-      where: { id: requestId },
+      where: {},
       include: { items: true }
     })

[Survived] ArrowFunction
src/controllers/order.controller.js:90:31
 
     // add items
     await prisma.orderItem.createMany({
-      data: request.items.map(i => ({
-        name: i.name,
-        quantity: i.quantity,
-        unitPrice: i.unitPrice,
-        orderId
-      }))
+      data: request.items.map(() => undefined)
     })
 

[Survived] ObjectLiteral
src/controllers/order.controller.js:99:33
     })
 
     // link request → order (IMPORTANT FIX)
-    await prisma.request.update({
-      where: { id: requestId },
-      data: { orderId }
-    })
+    await prisma.request.update({})
 
     res.json({ message: "Added to order" })

[Survived] ObjectLiteral
src/controllers/order.controller.js:100:14
 
     // link request → order (IMPORTANT FIX)
     await prisma.request.update({
-      where: { id: requestId },
+      where: {},
       data: { orderId }
     })

[Survived] ObjectLiteral
src/controllers/order.controller.js:104:14
       data: { orderId }
     })
 
-    res.json({ message: "Added to order" })
+    res.json({})
 
   } catch (err) {

[Survived] BlockStatement
src/controllers/order.controller.js:106:17
 
     res.json({ message: "Added to order" })
 
-  } catch (err) {
-    console.error("ADD TO ORDER ERROR:", err)
-    res.status(500).json({ error: "Failed" })
-  }
+  } catch (err) {}
 }
 

[Survived] StringLiteral
src/controllers/order.controller.js:107:19
     res.json({ message: "Added to order" })
 
   } catch (err) {
-    console.error("ADD TO ORDER ERROR:", err)
+    console.error("", err)
     res.status(500).json({ error: "Failed" })
   }

[Survived] ObjectLiteral
src/controllers/order.controller.js:108:26
 
   } catch (err) {
     console.error("ADD TO ORDER ERROR:", err)
-    res.status(500).json({ error: "Failed" })
+    res.status(500).json({})
   }
 }

[Survived] BlockStatement
src/controllers/order.controller.js:115:7
 
 // CREATE MANUAL ORDER
 export const createManualOrder = async (req, res) => {
-  try {
-    const { managerId, items } = req.body
-
-    console.log("MANUAL ORDER HIT", req.body)
-
-    const order = await prisma.order.create({
-  data: {
-    name: `Manual-${Date.now()}`, // ✅
-    managerId,
-    status: "DRAFT",
-    items: {
-      create: items.map(i => ({
-        name: i.name,
-        quantity: i.quantity,
-        unitPrice: i.unitPrice
-      }))
-    }
-  }
-})
-
-    res.json(order)
-
-  } catch (err) {
+  try {} catch (err) {
     console.error("MANUAL ORDER ERROR:", err)
     res.status(500).json({ error: "Failed" })

[Survived] ObjectLiteral
src/controllers/order.controller.js:121:9
     console.log("MANUAL ORDER HIT", req.body)
 
     const order = await prisma.order.create({
-  data: {
-    name: `Manual-${Date.now()}`, // ✅
-    managerId,
-    status: "DRAFT",
-    items: {
-      create: items.map(i => ({
-        name: i.name,
-        quantity: i.quantity,
-        unitPrice: i.unitPrice
-      }))
-    }
-  }
+  data: {}
 })
 

[Survived] StringLiteral
src/controllers/order.controller.js:122:11
 
     const order = await prisma.order.create({
   data: {
-    name: `Manual-${Date.now()}`, // ✅
+    name: ``, // ✅
     managerId,
     status: "DRAFT",

[Survived] ArrowFunction
src/controllers/order.controller.js:126:25
     managerId,
     status: "DRAFT",
     items: {
-      create: items.map(i => ({
-        name: i.name,
-        quantity: i.quantity,
-        unitPrice: i.unitPrice
-      }))
+      create: items.map(() => undefined)
     }
   }

[Survived] BlockStatement
src/controllers/order.controller.js:137:17
 
     res.json(order)
 
-  } catch (err) {
-    console.error("MANUAL ORDER ERROR:", err)
-    res.status(500).json({ error: "Failed" })
-  }
+  } catch (err) {}
 }
 

[Survived] BlockStatement
src/controllers/order.controller.js:143:48
   }
 }
 
-export const submitOrder = async (req, res) => {
-  const { orderId } = req.params
-  const { vendorId } = req.body
-
-  const order = await prisma.order.update({
-    where: { id: orderId },
-    data: {
-      status: "SUBMITTED",
-      vendorId: vendorId
-    }
-  })
-
-  res.json(order)
-}
+export const submitOrder = async (req, res) => {}
 
 

[Survived] ObjectLiteral
src/controllers/order.controller.js:147:43
   const { orderId } = req.params
   const { vendorId } = req.body
 
-  const order = await prisma.order.update({
-    where: { id: orderId },
-    data: {
-      status: "SUBMITTED",
-      vendorId: vendorId
-    }
-  })
+  const order = await prisma.order.update({})
 
   res.json(order)

[Killed] BlockStatement
src/controllers/order.controller.js:159:48
 }
 
 
-export const cancelOrder = async (req, res) => {
-  try {
-    const { orderId } = req.params
-
-    if (!orderId) {
-      return res.status(400).json({ error: "Missing orderId" })
-    }
-
-    const updated = await prisma.order.update({
-      where: { id: orderId },
-      data: {
-        status: "CANCELLED"
-      }
-    })
-    console.log("PARAMS:", req.params)
-
-    res.json(updated)
-
-  } catch (err) {
-    console.error("CANCEL ERROR:", err)
-    res.status(500).json({ error: "Failed to cancel order" })
-  }
-}
+export const cancelOrder = async (req, res) => {}
killedBy: Cancel Order Should cancel order
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/controllers/order.controller.js:160:7
 
 
 export const cancelOrder = async (req, res) => {
-  try {
-    const { orderId } = req.params
-
-    if (!orderId) {
-      return res.status(400).json({ error: "Missing orderId" })
-    }
-
-    const updated = await prisma.order.update({
-      where: { id: orderId },
-      data: {
-        status: "CANCELLED"
-      }
-    })
-    console.log("PARAMS:", req.params)
-
-    res.json(updated)
-
-  } catch (err) {
+  try {} catch (err) {
     console.error("CANCEL ERROR:", err)
     res.status(500).json({ error: "Failed to cancel order" })
killedBy: Cancel Order Should cancel order
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/controllers/order.controller.js:163:9
   try {
     const { orderId } = req.params
 
-    if (!orderId) {
+    if (true) {
       return res.status(400).json({ error: "Missing orderId" })
     }
killedBy: Cancel Order Should cancel order
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BooleanLiteral
src/controllers/order.controller.js:163:9
   try {
     const { orderId } = req.params
 
-    if (!orderId) {
+    if (orderId) {
       return res.status(400).json({ error: "Missing orderId" })
     }
killedBy: Cancel Order Should cancel order
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Survived] ObjectLiteral
src/controllers/order.controller.js:164:35
     const { orderId } = req.params
 
     if (!orderId) {
-      return res.status(400).json({ error: "Missing orderId" })
+      return res.status(400).json({})
     }
 

[Killed] ObjectLiteral
src/controllers/order.controller.js:167:47
       return res.status(400).json({ error: "Missing orderId" })
     }
 
-    const updated = await prisma.order.update({
-      where: { id: orderId },
-      data: {
-        status: "CANCELLED"
-      }
-    })
+    const updated = await prisma.order.update({})
     console.log("PARAMS:", req.params)
 
killedBy: Cancel Order Should cancel order
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ObjectLiteral
src/controllers/order.controller.js:169:13
 
     const updated = await prisma.order.update({
       where: { id: orderId },
-      data: {
-        status: "CANCELLED"
-      }
+      data: {}
     })
     console.log("PARAMS:", req.params)
killedBy: Cancel Order Should cancel order
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CANCELLED"
Received: "DRAFT"

[Survived] StringLiteral
src/controllers/order.controller.js:173:17
         status: "CANCELLED"
       }
     })
-    console.log("PARAMS:", req.params)
+    console.log("", req.params)
 
     res.json(updated)

[Survived] BlockStatement
src/controllers/order.controller.js:177:17
 
     res.json(updated)
 
-  } catch (err) {
-    console.error("CANCEL ERROR:", err)
-    res.status(500).json({ error: "Failed to cancel order" })
-  }
+  } catch (err) {}
 }
