[Survived] BlockStatement
src/controllers/vendor.controller.js:4:52
 import prisma from "../config/db.js"
 
 /* ---------- GET ORDERS ---------- */
-export const getVendorOrders = async (req, res) => {
-  const { vendorId } = req.params
-
-  const orders = await prisma.order.findMany({
-    where: { vendorId },
-    include: { items: true }
-  })
-
-  res.json(orders)
-}
+export const getVendorOrders = async (req, res) => {}
 
 /* ---------- ACCEPT ---------- */

[Survived] BooleanLiteral
src/controllers/vendor.controller.js:9:23
 
   const orders = await prisma.order.findMany({
     where: { vendorId },
-    include: { items: true }
+    include: { items: false }
   })
 

[Killed] BlockStatement
src/controllers/vendor.controller.js:16:48
 }
 
 /* ---------- ACCEPT ---------- */
-export const acceptOrder = async (req, res) => {
-  const { orderId } = req.params
-
-  await prisma.order.update({
-    where: { id: orderId },
-    data: { status: "ACCEPTED" }
-  })
-
-  res.json({ message: "Accepted" })
-}
+export const acceptOrder = async (req, res) => {}
 
 /* ---------- REJECT ---------- */
killedBy: Vendor Order Workflow Vendor accepts order
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ObjectLiteral
src/controllers/vendor.controller.js:20:12
   const { orderId } = req.params
 
   await prisma.order.update({
-    where: { id: orderId },
+    where: {},
     data: { status: "ACCEPTED" }
   })
killedBy: Vendor Order Workflow Vendor accepts order
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Survived] ObjectLiteral
src/controllers/vendor.controller.js:24:12
     data: { status: "ACCEPTED" }
   })
 
-  res.json({ message: "Accepted" })
+  res.json({})
 }
 

[Killed] BlockStatement
src/controllers/vendor.controller.js:28:48
 }
 
 /* ---------- REJECT ---------- */
-export const rejectOrder = async (req, res) => {
-  const { orderId } = req.params
-
-  await prisma.order.update({
-    where: { id: orderId },
-    data: { status: "REJECTED" }
-  })
-
-  res.json({ message: "Rejected" })
-}
+export const rejectOrder = async (req, res) => {}
 
 /* ---------- DELIVER ---------- */
killedBy: Vendor Order Workflow Vendor rejects order
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] StringLiteral
src/controllers/vendor.controller.js:33:21
 
   await prisma.order.update({
     where: { id: orderId },
-    data: { status: "REJECTED" }
+    data: { status: "" }
   })
 
killedBy: Vendor Order Workflow Vendor rejects order
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "REJECTED"
Received: ""

[Survived] BlockStatement
src/controllers/vendor.controller.js:52:7
 // }
 
 export const deliverOrder = async (req, res) => {
-  try {
-    const { orderId } = req.params
-
-    await prisma.order.update({
-      where: { id: orderId },
-      data: {
-        status: "DELIVERED",
-        deliveredAt: new Date()
-      }
-    })
-
-    await prisma.vendorOrder.update({
-      where: {
-        orderId
-      },
-      data: {
-        status: "DELIVERED"
-      }
-    })
-
-    res.json({
-      message: "Order marked delivered"
-    })
-
-  } catch (err) {
+  try {} catch (err) {
     console.error(err)
     res.status(500).json({

[Survived] ObjectLiteral
src/controllers/vendor.controller.js:57:13
 
     await prisma.order.update({
       where: { id: orderId },
-      data: {
-        status: "DELIVERED",
-        deliveredAt: new Date()
-      }
+      data: {}
     })
 

[Survived] ObjectLiteral
src/controllers/vendor.controller.js:63:37
       }
     })
 
-    await prisma.vendorOrder.update({
-      where: {
-        orderId
-      },
-      data: {
-        status: "DELIVERED"
-      }
-    })
+    await prisma.vendorOrder.update({})
 
     res.json({

[Survived] ObjectLiteral
src/controllers/vendor.controller.js:67:13
       where: {
         orderId
       },
-      data: {
-        status: "DELIVERED"
-      }
+      data: {}
     })
 

[Survived] ObjectLiteral
src/controllers/vendor.controller.js:72:14
       }
     })
 
-    res.json({
-      message: "Order marked delivered"
-    })
+    res.json({})
 
   } catch (err) {

[Survived] StringLiteral
src/controllers/vendor.controller.js:73:16
     })
 
     res.json({
-      message: "Order marked delivered"
+      message: ""
     })
 

[Survived] BlockStatement
src/controllers/vendor.controller.js:76:17
       message: "Order marked delivered"
     })
 
-  } catch (err) {
-    console.error(err)
-    res.status(500).json({
-      error: "Failed to mark delivered"
-    })
-  }
+  } catch (err) {}
 }
 /* ---------- AUCTIONS ---------- */

[Survived] ObjectLiteral
src/controllers/vendor.controller.js:78:26
 
   } catch (err) {
     console.error(err)
-    res.status(500).json({
-      error: "Failed to mark delivered"
-    })
+    res.status(500).json({})
   }
 }

[Survived] StringLiteral
src/controllers/vendor.controller.js:79:14
   } catch (err) {
     console.error(err)
     res.status(500).json({
-      error: "Failed to mark delivered"
+      error: ""
     })
   }

[Survived] BlockStatement
src/controllers/vendor.controller.js:104:7
 
 
 export const getVendorAuctions = async (req, res) => {
-  try {
-    const { vendorId } = req.params
-
-    const invites = await prisma.auctionInvite.findMany({
-      where: {
-        vendorId
-      },
-      include: {
-        auction: {
-          include: {
-            items: true,
-            manager: true
-          }
-        }
-      }
-    })
-
-    const auctions = invites.map(i => i.auction)
-
-    res.json(auctions)
-
-  } catch (err) {
+  try {} catch (err) {
     console.error("GET VENDOR AUCTIONS ERROR:", err)
     res.status(500).json({

[Survived] ObjectLiteral
src/controllers/vendor.controller.js:108:14
     const { vendorId } = req.params
 
     const invites = await prisma.auctionInvite.findMany({
-      where: {
-        vendorId
-      },
+      where: {},
       include: {
         auction: {

[Survived] ObjectLiteral
src/controllers/vendor.controller.js:113:20
       },
       include: {
         auction: {
-          include: {
-            items: true,
-            manager: true
-          }
+          include: {}
         }
       }

[Survived] ArrowFunction
src/controllers/vendor.controller.js:121:34
       }
     })
 
-    const auctions = invites.map(i => i.auction)
+    const auctions = invites.map(() => undefined)
 
     res.json(auctions)

[Survived] BlockStatement
src/controllers/vendor.controller.js:125:17
 
     res.json(auctions)
 
-  } catch (err) {
-    console.error("GET VENDOR AUCTIONS ERROR:", err)
-    res.status(500).json({
-      error: "Failed to fetch vendor auctions"
-    })
-  }
+  } catch (err) {}
 }
 

[Survived] ObjectLiteral
src/controllers/vendor.controller.js:127:26
 
   } catch (err) {
     console.error("GET VENDOR AUCTIONS ERROR:", err)
-    res.status(500).json({
-      error: "Failed to fetch vendor auctions"
-    })
+    res.status(500).json({})
   }
 }

[Survived] BlockStatement
src/controllers/vendor.controller.js:133:50
   }
 }
 
-export const getVendorBids = async (req, res) => {
-  try {
-    const { vendorId } = req.params
-
-    const bids = await prisma.bid.findMany({
-      where: { vendorId },
-      include: {
-        auction: true
-      },
-      orderBy: {
-        createdAt: "desc"
-      }
-    })
-
-    res.json(bids)
-
-  } catch (err) {
-    console.error("GET VENDOR BIDS ERROR:", err)
-    res.status(500).json({
-      error: "Failed to fetch vendor bids"
-    })
-  }
-}
+export const getVendorBids = async (req, res) => {}
 
 

[Survived] BlockStatement
src/controllers/vendor.controller.js:134:7
 }
 
 export const getVendorBids = async (req, res) => {
-  try {
-    const { vendorId } = req.params
-
-    const bids = await prisma.bid.findMany({
-      where: { vendorId },
-      include: {
-        auction: true
-      },
-      orderBy: {
-        createdAt: "desc"
-      }
-    })
-
-    res.json(bids)
-
-  } catch (err) {
+  try {} catch (err) {
     console.error("GET VENDOR BIDS ERROR:", err)
     res.status(500).json({

[Survived] BooleanLiteral
src/controllers/vendor.controller.js:140:18
     const bids = await prisma.bid.findMany({
       where: { vendorId },
       include: {
-        auction: true
+        auction: false
       },
       orderBy: {

[Survived] StringLiteral
src/controllers/vendor.controller.js:143:20
         auction: true
       },
       orderBy: {
-        createdAt: "desc"
+        createdAt: ""
       }
     })

[Survived] BlockStatement
src/controllers/vendor.controller.js:149:17
 
     res.json(bids)
 
-  } catch (err) {
-    console.error("GET VENDOR BIDS ERROR:", err)
-    res.status(500).json({
-      error: "Failed to fetch vendor bids"
-    })
-  }
+  } catch (err) {}
 }
 

[Survived] StringLiteral
src/controllers/vendor.controller.js:152:14
   } catch (err) {
     console.error("GET VENDOR BIDS ERROR:", err)
     res.status(500).json({
-      error: "Failed to fetch vendor bids"
+      error: ""
     })
   }

[Survived] ObjectLiteral
src/controllers/vendor.controller.js:169:20
       },
       include: {
         order: {
-          include: {
-            items: true
-          }
+          include: {}
         }
       }

[Survived] ArithmeticOperator
src/controllers/vendor.controller.js:177:19
     })
 
     const total = vendorOrder.order.items.reduce(
-      (sum, i) => sum + i.quantity * i.unitPrice,
+      (sum, i) => sum - i.quantity * i.unitPrice,
       0
     )

[Survived] ArithmeticOperator
src/controllers/vendor.controller.js:177:25
     })
 
     const total = vendorOrder.order.items.reduce(
-      (sum, i) => sum + i.quantity * i.unitPrice,
+      (sum, i) => sum + i.quantity / i.unitPrice,
       0
     )

[Survived] ObjectLiteral
src/controllers/vendor.controller.js:182:10
     )
 
     const existing = await prisma.invoice.findFirst({
-  where: {
-    vendorOrderId: vendorOrder.id
-  }
+  where: {}
 })
 

[Survived] BlockStatement
src/controllers/vendor.controller.js:187:15
   }
 })
 
-if (existing) {
-  return res.status(400).json({
-    error: "Invoice already exists for this order"
-  })
-}
+if (existing) {}
 
     const invoice = await prisma.invoice.create({

[Survived] BlockStatement
src/controllers/vendor.controller.js:206:17
 
     res.json(invoice)
 
-  } catch (err) {
-    console.error(err)
-    res.status(500).json({
-      error: "Failed to submit invoice"
-    })
-  }
+  } catch (err) {}
 }
 

[Survived] ObjectLiteral
src/controllers/vendor.controller.js:241:14
     const vendorId = req.user.id
 
     const vendorOrders = await prisma.vendorOrder.findMany({
-      where: {
-        vendorId,
-        status: "DELIVERED",
-        invoice: null
-      },
+      where: {},
       include: {
         order: {

[Survived] ObjectLiteral
src/controllers/vendor.controller.js:247:16
         invoice: null
       },
       include: {
-        order: {
-          include: {
-            items: true
-          }
-        }
+        order: {}
       }
     })

[Survived] ArrowFunction
src/controllers/vendor.controller.js:255:40
       }
     })
 
-    const formatted = vendorOrders.map(vo => ({
-      id: vo.order.id,
-      name: vo.order.name,
-      items: vo.order.items
-    }))
+    const formatted = vendorOrders.map(() => undefined)
 
     res.json(formatted)

[Survived] BlockStatement
src/controllers/vendor.controller.js:263:17
 
     res.json(formatted)
 
-  } catch (err) {
-    console.error("GET ELIGIBLE ORDERS ERROR:", err)
-    res.status(500).json({
-      error: "Failed to fetch eligible orders"
-    })
-  }
+  } catch (err) {}
 }
 

[Survived] ObjectLiteral
src/controllers/vendor.controller.js:278:22
 
     const invoices = await prisma.invoice.findMany({
       where: {
-        vendorOrder: {
-          vendorId
-        }
+        vendorOrder: {}
       },
       include: {

[Survived] ObjectLiteral
src/controllers/vendor.controller.js:282:16
           vendorId
         }
       },
-      include: {
-        vendorOrder: {
-          include: {
-            order: true
-          }
-        },
-        payment: true
-      },
+      include: {},
       orderBy: {
         issuedAt: "desc"

[Survived] BooleanLiteral
src/controllers/vendor.controller.js:285:20
       include: {
         vendorOrder: {
           include: {
-            order: true
+            order: false
           }
         },

[Survived] ArrowFunction
src/controllers/vendor.controller.js:295:36
       }
     })
 
-    const formatted = invoices.map(inv => ({
-      id: inv.id,
-      invoiceNumber: inv.invoiceNumber,
-      totalAmount: inv.totalAmount,
-      dueDate: inv.dueDate,
-      issuedAt: inv.issuedAt,
-      notes: inv.notes,
-
-      status:
-        inv.payment?.status === "COMPLETED"
-          ? "PAID"
-          : "SUBMITTED",
-
-      order: inv.vendorOrder.order
-    }))
+    const formatted = invoices.map(() => undefined)
 
     res.json(formatted)

[Survived] EqualityOperator
src/controllers/vendor.controller.js:304:9
       notes: inv.notes,
 
       status:
-        inv.payment?.status === "COMPLETED"
+        inv.payment?.status !== "COMPLETED"
           ? "PAID"
           : "SUBMITTED",

[Survived] OptionalChaining
src/controllers/vendor.controller.js:304:9
       notes: inv.notes,
 
       status:
-        inv.payment?.status === "COMPLETED"
+        inv.payment.status === "COMPLETED"
           ? "PAID"
           : "SUBMITTED",

[Survived] BlockStatement
src/controllers/vendor.controller.js:313:17
 
     res.json(formatted)
 
-  } catch (err) {
-    console.error("GET VENDOR INVOICES ERROR:", err)
-    res.status(500).json({
-      error: "Failed to fetch vendor invoices"
-    })
-  }
+  } catch (err) {}
 }

[Survived] ObjectLiteral
src/controllers/vendor.controller.js:315:26
 
   } catch (err) {
     console.error("GET VENDOR INVOICES ERROR:", err)
-    res.status(500).json({
-      error: "Failed to fetch vendor invoices"
-    })
+    res.status(500).json({})
   }
 }
