[Survived] BlockStatement
src/controllers/order.controller.js:163:19
   try {
     const { orderId } = req.params
 
-    if (!orderId) {
-      return res.status(400).json({ error: "Missing orderId" })
-    }
+    if (!orderId) {}
 
     const updated = await prisma.order.update({
